app/views/profiles/account_setting.erb

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
---

              <%= text_field_tag :first_name, "#{@current_user.profile.first_name}"  %></div>