app/views/profiles/edit.erb

SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`profile_id` = 2
---
  <div class="row well tags">
    <%= text_area_tag :tags, @tags.join(" "),:class => "text-area" %>