app/views/profiles/show.erb

SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`profile_id` = 2
---
  <% unless @profile.tags == [] %>
    <% @profile.tags.each do |tag| %>