app/views/people/_person.html.erb

SELECT `aspects`.* FROM `aspects` INNER JOIN `aspect_memberships` ON `aspects`.`id` = `aspect_memberships`.`aspect_id` WHERE `aspect_memberships`.`person_id` = 1
---
<%@buttonname= "Follow"%>
<%@current_user.aspects.each do |aspect| %>