app/views/conversations/index.erb

SELECT `messages`.* FROM `messages` WHERE `messages`.`conversation_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
        <a href="#">
          <img class="profile-pic" src="<%=conversation.messages.first.person.user.profile.photo.url%>" alt=""></a>