app/views/conversations/new.erb

SELECT `users`.* FROM `users`
---
          <input id="receiver" type="hidden" value="<%= params[:receiver] %>">
         <%= select "friends", "username" , User.all.collect{ |f| [f.username.capitalize]  } %>