app/views/notifications/index.erb

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
---
<% @notifications.each do |notification| %>
	<%@notifier = Person.find(notification.notifier_id).user.profile%>
	<% if notification.target_type == "Comment"%>
		<%@commentary = Comment.find(notification.target_id).commentary_type%>