app/views/actions/_new.erb

SELECT 1 FROM `people` INNER JOIN `actors` ON `people`.`id` = `actors`.`person_id` WHERE `actors`.`action_id` = 1 AND `people`.`id` = 1 LIMIT 1
---
    <li>
      <%if target.action.people.include?(@current_person)%>

SELECT COUNT(*) FROM `people` INNER JOIN `actors` ON `people`.`id` = `actors`.`person_id` WHERE `actors`.`action_id` = 1
---
          UnLike
          <sup class="post-counts"><%=target.action.people.count%></sup>