app/views/videos/index.html.erb

<h1 id="album-header"><%=@person.user.profile.first_name%>'s Videos</h1>
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1