app/views/home/index.html.erb

      <ul class="dropdown-menu">
        <%@current_user.aspects.each do |aspect| %>
---
SELECT `aspects`.* FROM `aspects` WHERE `aspects`.`user_id` = 1