app/views/albums/index.erb

SELECT `albums`.* FROM `albums` WHERE `albums`.`person_id` = 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
<h1 id="album-header"><%=@person.user.profile.first_name%>'s Albums</h1>