app/views/aspects/index.html.erb

SELECT `aspects`.* FROM `aspects` WHERE `aspects`.`user_id` = 1
SELECT `people`.* FROM `people` INNER JOIN `aspect_memberships` ON `people`.`id` = `aspect_memberships`.`person_id` WHERE `aspect_memberships`.`aspect_id` = 1
---
  <!-- /friends-search-->
  <%@current_user.aspects[0].people.each do |aspect_member| %>

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
        <div class="span8">
            <h4 style="font-size:9px;"><a href="<%= profile_path(aspect_member.user.username) %>"><%="#{aspect_member.user.profile.first_name} #{aspect_member.user.profile.last_name}"%></a>