app/views/posts/_new.html.erb

SELECT `aspects`.* FROM `aspects` WHERE `aspects`.`user_id` = 1
---

        <%@current_user.aspects.each do |aspect| %>

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
              <h4>
                <a href="<%= profile_path(post.person.user.username) %>"><%="#{post.person.user.profile.first_name.capitalize} #{post.person.user.profile.last_name.capitalize}"%></a>