app/controllers/actions_controller.rb

	def like
		@action = Action.find(params[:id])
---
SELECT `actions`.* FROM `actions` WHERE `actions`.`id` = 2 LIMIT 1

	def unlike
		@action = Action.find(params[:id])
---
SELECT `actions`.* FROM `actions` WHERE `actions`.`id` = 1 LIMIT 1