app/controllers/albums_controller.rb

	def index
		@person = User.find_by_username(params[:profile_id]).person
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'Azzurrio' LIMIT 1