app/controllers/albums_controller.rb

SELECT `albums`.* FROM `albums` WHERE `albums`.`person_id` = 1
---
	def index
		@albums= @current_user.person.albums.all

INSERT INTO `albums` (`cover_url`, `created_at`, `description`, `location`, `person_id`, `title`, `updated_at`) VALUES (NULL, '2012-06-26 10:42:53', '', '', NULL, 'Stream Posts', '2012-06-26 10:42:53')
UPDATE `albums` SET `person_id` = 1, `updated_at` = '2012-06-26 10:42:53' WHERE `albums`.`id` = 1
INSERT INTO `actions` (`created_at`, `target_id`, `target_type`, `updated_at`) VALUES ('2012-06-26 10:42:53', 1, 'Album', '2012-06-26 10:42:53')
---
	def create
		@album= Album.create params[:album]
		@album.person = @current_person
		if @album.save
      		Action.create(:target_type => 'Album', :target_id => @album.id)

SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 0 LIMIT 1
---
	def show
		@album= Album.find params[:id]