app/controllers/aspects_controller.rb

INSERT INTO `aspects` (`created_at`, `hidden`, `name`, `updated_at`, `user_id`) VALUES ('2012-06-25 06:29:21', 0, 'friends ', '2012-06-25 06:29:21', 1)
---
	def create
		@aspect = Aspect.new :name => params[:aspect][:name]
		if params[:aspect][:hidden] == "True"
			@aspect.hidden = true
		end
		@aspect.user = @current_user
		@aspect.save

SELECT `aspects`.* FROM `aspects` WHERE `aspects`.`id` = 2 LIMIT 1
SELECT `aspects`.* FROM `aspects` WHERE `aspects`.`user_id` = 1
SELECT `people`.* FROM `people` INNER JOIN `aspect_memberships` ON `people`.`id` = `aspect_memberships`.`person_id` WHERE `aspect_memberships`.`aspect_id` = 1 AND `people`.`id` = 2 LIMIT 1
INSERT INTO `notifications` (`created_at`, `notifier_id`, `person_id`, `read`, `target_id`, `target_type`, `target_url`, `updated_at`) VALUES ('2012-06-25 06:31:50', 1, 2, 0, NULL, 'Follower', '/ahmdrefat', '2012-06-25 06:31:50')
---
	def add
		@aspect= Aspect.find params[:id]
		@p = Person.find params[:person_id]
		unless @aspect == @current_user.aspects[0]
		 	@aspect.people << @p
		end
		unless @current_user.aspects[0].people.find_by_id(@p.id)
			@current_user.aspects[0].people << @p
         	Notification.create(:target_type => 'Follower',
          	:target_url => @current_person.profile_link,
          	:person_id => @p.id,
          	:notifier_id => @current_person.id)