app/controllers/comments_controller.rb

	def create
			@comment = Comment.new({:content => params[:content] ,:post_id => params[:post_id]})
			@comment.person_id = User.find(session[:user_id]).person.id
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1