app/controllers/comments_controller.rb

INSERT INTO `comments` (`commentary_id`, `commentary_type`, `content`, `created_at`, `person_id`, `updated_at`) VALUES (2, 'Post', 'asgida', '2012-06-25 06:48:40', 1, '2012-06-25 06:48:40')
INSERT INTO `actions` (`created_at`, `target_id`, `target_type`, `updated_at`) VALUES ('2012-06-25 06:48:40', 1, 'comment', '2012-06-25 06:48:40')
INSERT INTO `notifications` (`created_at`, `notifier_id`, `person_id`, `read`, `target_id`, `target_type`, `target_url`, `updated_at`) VALUES ('2012-06-25 06:48:40', 1, 2, 0, 1, 'Comment', '/comments/show/1', '2012-06-25 06:48:40')
---
	def create
			@comment = Comment.new({:content => params[:content] ,:commentary_id => params[:commentary_id], :commentary_type => params[:commentary_type] })
			@comment.person_id = @current_person.id
    	if @comment.save
      	Action.create(:target_type => 'comment', :target_id => @comment.id)
      	if params[:person_id] != @comment.person_id.to_s
          Notification.create(:target_type => 'Comment',
          :target_url => "/comments/show/#{@comment.id}",
          :person_id => params[:person_id],
          :notifier_id => @comment.person_id)

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
    comment_d = Comment.find params[:id]
    comment_d.destroy

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
---
  def show
    @comment = Comment.find params[:id]