app/controllers/conversations_controller.rb

SELECT `conversations`.* FROM `conversations`
SELECT `people`.* FROM `people` INNER JOIN `conversation_statuses` ON `people`.`id` = `conversation_statuses`.`person_id` WHERE `conversation_statuses`.`conversation_id` = 1 AND `people`.`user_id` = 2 LIMIT 1
---
	def index
		@conversations = []
		Conversation.all.each do |conversation|
			if conversation.people.find_by_user_id(@current_user) && conversation.conversation_statuses.find_by_person_id(@current_person).visibility

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'mohmd' LIMIT 1
INSERT INTO `conversations` (`created_at`, `subject`, `updated_at`) VALUES ('2012-06-25 06:49:52', 'adfasfda', '2012-06-25 06:49:52')
INSERT INTO `conversation_statuses` (`conversation_id`, `created_at`, `person_id`, `unread`, `updated_at`, `visibility`) VALUES (1, '2012-06-25 06:49:52', 2, 0, '2012-06-25 06:49:52', 1)
INSERT INTO `messages` (`content`, `conversation_id`, `created_at`, `person_id`, `unread`, `updated_at`) VALUES ('dfasdfasd', 1, '2012-06-25 06:49:52', 2, 1, '2012-06-25 06:49:52')
---
	def create

		receiver = User.find_by_username params[:friends][:username].downcase

		if params[:content] == ""
			flash[:no_content] = "Cannot send empty message"
			render "/conversations/new/"
		else

			@conversation = Conversation.create({subject: params[:subject]})

			@sender = ConversationStatus.create({person_id:@current_user.id, conversation_id: @conversation.id, unread: false, visibility: true })

			#in case to allow sending for more than one, make an array of receivers, and loop over it
			@receiver = ConversationStatus.create({person_id: receiver.id, conversation_id: @conversation.id, unread: true, visibility: true})

			@message = Message.create({conversation_id: @conversation.id, content: params[:content], person_id: @current_user.id, unread: true})

SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 0 LIMIT 1
SELECT `conversation_statuses`.* FROM `conversation_statuses` WHERE `conversation_statuses`.`conversation_id` = 1 AND `conversation_statuses`.`person_id` = 2 LIMIT 1
UPDATE `conversation_statuses` SET `unread` = 0, `updated_at` = '2012-06-25 07:26:30' WHERE `conversation_statuses`.`id` = 4
---
	def show
		@conversation = Conversation.find params[:id]
		@messages = @conversation.messages

		conversation_status = @conversation.conversation_statuses.find_by_person_id @current_person

		if conversation_status.unread
			conversation_status.update_attribute :unread, false