app/controllers/images_controller.rb

	def show
		@image = Image.find params[:id]
---
SELECT `images`.* FROM `images` WHERE `images`.`id` = 1 LIMIT 1