app/controllers/notifications_controller.rb

	def index
		@notifications = @current_person.notifications.order
---
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`person_id` = 1

	def show
		@notification= Notification.find params[:id]
		@notification.read= true
		@notification.save
---
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`id` = 2 LIMIT 1
UPDATE `notifications` SET `read` = 1, `updated_at` = '2012-06-25 06:33:10' WHERE `notifications`.`id` = 2