app/controllers/posts_controller.rb

INSERT INTO `images` (`album_id`, `caption`, `created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `location`, `updated_at`) VALUES (1, 'CoooL', '2012-06-26 10:43:14', 'image/jpeg', 'Robo.jpg', 366669, '2012-06-26 10:43:14', 'Home', '2012-06-26 10:43:14')
INSERT INTO `posts` (`content`, `created_at`, `group_id`, `link_url`, `person_id`, `photo_url`, `post_type`, `updated_at`, `url_title`, `video_url`) VALUES ('hi', '2012-06-25 06:29:31', NULL, NULL, 1, NULL, 'status', '2012-06-25 06:29:31', NULL, NULL)
INSERT INTO `actions` (`created_at`, `target_id`, `target_type`, `updated_at`) VALUES ('2012-06-25 06:29:31', 1, 'Post', '2012-06-25 06:29:31')
INSERT INTO `videos` (`created_at`, `description`, `link`, `person_id`, `title`, `updated_at`) VALUES ('2012-06-26 13:06:44', NULL, 'http://www.youtube.com/embed/f7sLNRSb68E', 1, 'Stream Post', '2012-06-26 13:06:44')
---
	def create
		@post = Post.new(params[:post])
		parts = @post.content.split('.')
		if params[:uploaded_photo] 	#In Case User Upload a Photo
			@image = Image.new :caption => @post.content, :album_id => @current_person.albums[0], :location => 'Home'
			@image.image = params[:uploaded_photo]
			if @current_person.albums[0].images[0] == @image
				@current_person.albums[0].cover_url = @image.image.url
			end
			if @image.save
      			Action.create(:target_type => 'Image', :target_id => @image.id)
      			@post.post_type= "photo"
      			@post.photo_url = @image.image.url
    		else
      			render text: "Something worng happen while Uploading"
      		end
		elsif parts[0] == "http://www" || parts[0] == "www" || parts[0] == "youtube" #In Case User copy video address
			@post.post_type= "video"
			embeds = @post.content.split('=')
			embeds = embeds[1].split('&')
			@post.video_url = "http://www.youtube.com/embed/#{embeds[0]}"
			@video = Video.create :person_id => @current_person, :title =>"Stream Post", :link => @post.video_url

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 1 LIMIT 1
SELECT `images`.* FROM `images` WHERE `images`.`album_id` = 1
---
	def show
		@post= Post.find params[:id]
		if [:photo_url]
			p= Person.find params[:person_id]
			p.albums[0].images.each do |image|

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 4
---
	def destroy
		post_d = Post.find params[:id]

		post_d.comments.each do |c|
			c.destroy
		end
		post_d.destroy