app/controllers/posts_controller.rb

	def create
		@post = Post.new(params[:post])
		@post.post_type= "status"
		@post.person_id = @current_person.id
		#@post.aspects << Aspect.find_by_name("#{params[:aspect_name]}")
		@post.aspects << @current_user.aspects.find_by_name("#{params[:aspect_name]}")
---
SELECT `aspects`.* FROM `aspects` WHERE `aspects`.`user_id` = 1 AND `aspects`.`name` = 'MyAspects' LIMIT 1