app/controllers/profiles_controller.rb

	def index
		@profile = Profile.find_by_user_id @current_user.id
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1