app/controllers/profiles_controller.rb

INSERT INTO `profiles` (`allow_search`, `avatar`, `bio`, `birthdate`, `created_at`, `education`, `first_name`, `gender`, `last_name`, `location`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `updated_at`, `user_id`) VALUES (1, NULL, 'It\'s me', '2000-04-03', '2012-06-25 06:27:15', 'Stanford', 'ahmd', 'male', 'refat', 'cairo', 'image/png', 'apple-touch-icon.png', 86447, '2012-06-25 06:27:15', '2012-06-25 06:27:15', NULL)
SELECT `tags`.* FROM `tags` WHERE `tags`.`text` = 'asdf/adfasdf/adfsadsf' LIMIT 1
INSERT INTO `tags` (`created_at`, `text`, `updated_at`) VALUES ('2012-06-25 06:27:35', 'rails/cdv/asfa', '2012-06-25 06:27:35')
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
UPDATE `profiles` SET `user_id` = 1, `updated_at` = '2012-06-25 06:27:35' WHERE `profiles`.`id` = 2
INSERT INTO `aspects` (`created_at`, `hidden`, `name`, `updated_at`, `user_id`) VALUES ('2012-06-25 06:27:35', 0, 'MyAspects', '2012-06-25 06:27:35', 1)
INSERT INTO `albums` (`cover_url`, `created_at`, `description`, `location`, `person_id`, `title`, `updated_at`) VALUES (NULL, '2012-06-26 11:55:07', NULL, NULL, NULL, 'Stream Posts', '2012-06-26 11:55:07')
UPDATE `albums` SET `person_id` = 1, `updated_at` = '2012-06-26 11:55:07' WHERE `albums`.`id` = 1
INSERT INTO `actions` (`created_at`, `target_id`, `target_type`, `updated_at`) VALUES ('2012-06-26 11:55:07', 1, 'Album', '2012-06-26 11:55:07')
---
	def create
		@profile = Profile.create(params[:profile])
		@profile.user = @current_user
		# colleting tag
		tags = params[:tags].split(' ')

		tags.each do |tag|
			unless Tag.find_by_text tag
				new_tag = Tag.create :text => tag
				@profile.tags << new_tag
			else
				exist_tag = Tag.find_by_text tag
				@profile.tags << exist_tag unless @profile.tags.include? exist_tag
			end
		end

		if @profile.save
			@person= Person.create :profile_link => "/#{@current_user.username}", :user_id => @current_user.id
			@mydefaultaspect= Aspect.new :name => "MyAspects"
			@mydefaultaspect.user= @current_user
			@mydefaultaspect.save

			@album= Album.create :title => "Stream Posts"
			@album.person = @person
			if @album.save
      			Action.create(:target_type => 'Album', :target_id => @album.id)

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`profile_id` = 2
---
	def edit

		@profile = Profile.find_by_user_id @current_user.id

		@tags = []
		@profile.tags.each do |tag|

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
UPDATE `profiles` SET `photo_file_name` = 'DennisRitchie.gif', `photo_content_type` = 'image/gif', `photo_file_size` = 21945, `photo_updated_at` = '2012-06-29 07:30:29', `updated_at` = '2012-06-29 07:30:29' WHERE `profiles`.`id` = 2
SELECT `tags`.* FROM `tags` WHERE `tags`.`text` = 'rails/cdv/asfa' LIMIT 1
SELECT 1 FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`profile_id` = 2 AND `tags`.`id` = 1 LIMIT 1
---
	def update
		@profile = Profile.find_by_user_id @current_user.id
		@profile.update_attributes(params[:profile])

		@current_user.update_attributes(:email =>params[:email])

		tags = params[:tags].split(' ')

		# add new tags
		tags.each do |tag|
			unless Tag.find_by_text tag
				new_tag = Tag.create :text => tag
				@profile.tags << new_tag
			else
				exist_tag = Tag.find_by_text tag
				@profile.tags << exist_tag unless @profile.tags.include? exist_tag