app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `hashed_password`, `salt`, `updated_at`, `username`) VALUES ('2012-06-25 06:26:01', 'ahmdrefat@email.com', '$2a$10$WTDo0zZSu.IMlF9/TgCaWetM61qGGVS33OoI/iTKXjsNsU3U4OqFS', '$2a$10$WTDo0zZSu.IMlF9/TgCaWe', '2012-06-25 06:26:01', 'ahmdrefat')
---
	 def create
    	@user = User.new(params[:user])
    	if @user.save