app/controllers/videos_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'Azzurrio' LIMIT 1
---
  def index
  	@person = User.find_by_username(params[:profile_id]).person

SELECT `videos`.* FROM `videos` WHERE `videos`.`id` = 0 LIMIT 1
---
  def show
  	@video= Video.find params[:id]

INSERT INTO `videos` (`created_at`, `description`, `link`, `person_id`, `title`, `updated_at`) VALUES ('2012-06-26 12:51:18', '', 'http://www.youtube.com/watch?v=f7sLNRSb68E&feature=related', NULL, '', '2012-06-26 12:51:18')
INSERT INTO `actions` (`created_at`, `target_id`, `target_type`, `updated_at`) VALUES ('2012-06-26 12:56:31', 4, 'video', '2012-06-26 12:56:31')
---
  def create
  	@video= Video.new params[:video]
	@video.person = @current_person
	parts =params[:link].split('.')
	if parts[0] == "http://www" || parts[0] == "www" || parts[0] == "youtube"
			embeds = params[:link].split('=')
			embeds = embeds[1].split('&')
			@video.link = "http://www.youtube.com/embed/#{embeds[0]}"
		if @video.save
      		Action.create(:target_type => 'Video', :target_id => @video.id)